/* Визначте інтерфейс, який використовує сигнатуру індексу з типами об'єднання. Наприклад, тип значення для кожного ключа може бути число | рядок.
Створіть інтерфейс, у якому типи значень у сигнатурі індексу є функціями. Ключами можуть бути рядки, а значеннями — функції, які приймають будь-які аргументи.
Опишіть інтерфейс, який використовує сигнатуру індексу для опису об'єкта, подібного до масиву. Ключі повинні бути числами, а значення - певного типу.
Створіть інтерфейс з певними властивостями та індексною сигнатурою. Наприклад, ви можете мати властивості типу name: string та індексну сигнатуру для додаткових динамічних властивостей.
Створіть два інтерфейси, один з індексною сигнатурою, а інший розширює перший, додаючи специфічні властивості.
Напишіть функцію, яка отримує об'єкт з індексною сигнатурою і перевіряє, чи відповідають значення певних ключів певним критеріям (наприклад, чи всі значення є числами). */

// 1. Інтерфейс з сигнатурою індексу з типами об'єднання
interface IStringOrNumberDictionary {
  [key: string]: string | number;
}

// 2. Інтерфейс з функціями в сигнатурі індексу
interface IFunctionDictionary {
  [key: string]: (...args: any[]) => any;
}

// 3. Інтерфейс для об'єкта, подібного до масиву
interface IArrayLikeObject {
  [index: number]: string;
}

// 4. Інтерфейс з певними властивостями та індексною сигнатурою
interface IPerson {
  name: string;
  [key: string]: string; 
}

// 5. Два інтерфейси, один з індексною сигнатурою, а інший розширює перший
interface IAnimal {
  [key: string]: string;
}

interface IDog extends IAnimal {
  breed: string;
}

// 6. Функція, яка перевіряє, чи всі значення є числами

function areAllValuesNumbers(obj: { [key: string]: any }): boolean {
  for (const key in obj) {
    if (typeof obj[key] !== 'number') {
      return false;
    }
  }
  return true;
}
